## Noah's rug Day 1

### Imports

In [1]:
import sqlite3
import pandas as pd

## Establishing a database connection

In [2]:
DATABASE = "noahs.sqlite"
conn = sqlite3.connect(DATABASE)

## The task

- find the phone number 
- such that the last name spelled out = the phone number

### Data exploration

In [3]:
q = """
SELECT name,phone FROM CUSTOMERS 
WHERE name IS NOT NULL
AND phone IS NOT NULL
"""
names_and_phones = pd.read_sql_query(q,conn)
names_and_phones.head()

                    name         phone
0     Jacqueline Alvarez  315-377-5031
1           Julie Howell  680-537-8725
2        Christopher Ali  315-846-6054
3  Christopher Rodriguez  516-275-2292
4      Jeffrey Wilkinson  838-830-6960

### Getting the last names

In [4]:
def get_last_name(name:str):
    return name.split(" ")[-1]
names_and_phones['name'] = names_and_phones['name'].apply(get_last_name)
names_and_phones.head()

        name         phone
0    Alvarez  315-377-5031
1     Howell  680-537-8725
2        Ali  315-846-6054
3  Rodriguez  516-275-2292
4  Wilkinson  838-830-6960

### Re-formatting the phone number

In [5]:
names_and_phones['phone'] = names_and_phones['phone'].apply(lambda x: x.replace('-',''))
names_and_phones.head()

        name       phone
0    Alvarez  3153775031
1     Howell  6805378725
2        Ali  3158466054
3  Rodriguez  5162752292
4  Wilkinson  8388306960

### Mapping names to numbers

In [6]:
alphabet = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
numbers = []
for i in range(2,10):
    if i ==7 or i ==9:
        numbers += [i]*4
    else:
        numbers += [i]*3
phone_letters = {a:numbers[i] for i,a in enumerate(alphabet)}

In [7]:
def map_name_to_number(name):
    name = ''.join([n for n in name if n.isalpha()])
    return "".join([str(phone_letters[l]) for l in name.upper()])

names_and_phones['name mapped'] = names_and_phones['name'].apply(map_name_to_number)
names_and_phones.head()

        name       phone name mapped
0    Alvarez  3153775031     2582739
1     Howell  6805378725      469355
2        Ali  3158466054         254
3  Rodriguez  5162752292   763744839
4  Wilkinson  8388306960   945546766

### matches

In [8]:
names_and_phones[names_and_phones['name mapped'] == names_and_phones['phone']]

           name       phone name mapped
207  Tannenbaum  8266362286  8266362286